{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "Book-Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "Book-Input"}, "inbound_nodes": []}, {"name": "User-Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "User-Input"}, "inbound_nodes": []}, {"name": "Book-Embedding", "class_name": "Embedding", "config": {"name": "Book-Embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 10001, "output_dim": 5, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["Book-Input", 0, 0, {}]]]}, {"name": "User-Embedding", "class_name": "Embedding", "config": {"name": "User-Embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 53425, "output_dim": 5, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["User-Input", 0, 0, {}]]]}, {"name": "Flatten-Books", "class_name": "Flatten", "config": {"name": "Flatten-Books", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["Book-Embedding", 0, 0, {}]]]}, {"name": "Flatten-Users", "class_name": "Flatten", "config": {"name": "Flatten-Users", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["User-Embedding", 0, 0, {}]]]}, {"name": "Dot-Product", "class_name": "Dot", "config": {"name": "Dot-Product", "trainable": true, "axes": 1, "normalize": false}, "inbound_nodes": [[["Flatten-Books", 0, 0, {}], ["Flatten-Users", 0, 0, {}]]]}], "input_layers": [["User-Input", 0, 0], ["Book-Input", 0, 0]], "output_layers": [["Dot-Product", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}